{
  "home": {
    "start": "Los geht's!",
    "text1": "Werde schnell besser im",
    "text2": "Kopfrechnen!"
  },
  "navbar": {
    "locale": "Sprache",
    "appearance": "Design",
    "help": "Hilfe",
    "about": "Über"
  },
  "aboutDialog": {
    "title": "Über Math Chrono",
    "text1": "Dies ist ein kleines Tool, um dir beim Kopfrechnen zu helfen!",
    "text2": "Für jegliche Kommentare, Fragen oder Anfragen, kontaktiere mich bitte über die folgende Adresse:"
  },
  "params": {
    "title": "Parameter",
    "description": "Passe die folgenden Optionen an, um die Schwierigkeit deiner Math-Chrono-Session einzustellen.",
    "tablesToggleDescription": "Möchtest du Multiplikations-/Divisionstabellen oder Kopfrechnen üben?",
    "tablesLabel": "Tabellen",
    "mathLabel": "Kopfrechnen",
    "operationAmount": "Wie viele Rechnungen möchtest du ausführen?",
    "numberLabel": "Zahl",
    "yes": "Ja",
    "no": "Nein",
    "submit": "Übung starten!",
    "timer": {
      "description": "Möchtest du einen Timer einstellen?",
      "toggle": "Timer",
      "label": "Minuten und Sekunden"
    },
    "math": {
      "operandsDescription": "Wie viele Operanden (Zahlen) möchtest du in deinen Rechnungen?",
      "operators": "Welche Rechenarten möchtest du ausführen?",
      "maximumDescription": "Was soll die höchste Zahl in deinen Rechnungen sein?"
    },
    "negativeNumbers": {
      "description": "Möchtest du, dass die Operanden (Zahlen) oder die Ergebnisse der Rechnungen negative Zahlen sind?",
      "label": "Negative Zahlen",
      "mobileButtonDescription": "Manche Smartphones erlauben das Schreiben von negativen Zahlen nicht, falls dies der Fall ist, kannst du einen Knopf in der Oberfläche aktivieren um eine Zahl negativ zu machen.",
      "mobileButtonLabel": "Knopf für negative Zahlen"
    },
    "tables": {
      "toggle": "Tabellen",
      "tablesMaximum": "Bis zu welcher Tabelle möchtest du üben?",
      "operators": "Möchtest du Multiplikations- oder Divisionstabellen üben?",
      "selectionDescription": "Welche Tabellen würdest du gerne üben?"
    }
  },
  "math": {
    "title": "Math Chrono!",
    "start": "Start!",
    "text1": "Klicke auf ",
    "text2": " wenn du bereit bist!",
    "done": "Fertig!",
    "back": "Zurück",
    "restart": "Neu starten?"
  },
  "completed": {
    "title": "Es ist vorbei!",
    "result": "Hier ist dein Ergebnis:",
    "resultText1": "Du hast gelöst:",
    "resultText2singular": "Rechnung",
    "resultText2plural": "Rechnungen",
    "resultText3": "von",
    "resultText4": "in",
    "hour": "Stunde",
    "hours": "Stunden",
    "minute": "Minute",
    "minutes": "Minuten",
    "second": "Sekunde",
    "seconds": "Sekunden",
    "done1": "Guter Versuch!",
    "done2": "Du verbesserst dich!",
    "done3": "Sehr gut!",
    "done4": "Fantastisch",
    "done5": "Wow, perfektes Ergebnis!"
  },
  "update": {
    "message": "Eine neue Version von Math-Chrono ist verfügbar!",
    "offline": "App is ready to work offline.",
    "reload": "Neu laden",
    "close": "Schließen"
  },
  "howTo": {
    "title": "Wie funktioniert das?",
    "tableOfContent": "Inhaltsverzeichnis",
    "general": {
      "title": "Wofür ist diese App da?",
      "text1": "Diese App ist ein Tool, das dir beim Üben vom Kopfrechnen hilft, ganz egal ob mit oder ohne Zeitlimit. Es gibt viele Optionen, die du nach Belieben einstellen kannst um das Schwierigkeitslevel jeder Übung an dein eigenes Level anzupassen. So erhöht sich die Schwierigkeit immer weiter und gibt dir das Gefühl eines konstanten Fortschritts.",
      "text2": "Sobald alle Parameter eingestellt sind und die Übung gestartet wird, werden alle Rechnungen zufällig von der App generiert. Wenn der Countdown stoppt, gib so schnell wie möglich die Ergebnisse der Rechnungen ein!"
    },
    "params": {
      "title": "Beschreibungen der Parameter",
      "genericMinimum": "Es kann mindestens ",
      "genericMaximum": " und maximal ",
      "timerTitle": "Timer",
      "timerText": "Aktiviert oder deaktiviert den Timer. Falls der Timer aktiviert ist, kann ein Zeitlimit in Stunden, Minuten und Sekunden eingestellt werden. Zum Beispiel steht 00:05:30 für 5 Minuten und 30 Sekunden.",
      "numberOperandsTitle": "Anzahl an Operanden",
      "numberOperandsText1": "Die Anzahl an Operanden (Zahlen) in jeder Rechnung. Als Beispiel, hier findest du eine Rechnung mit 3 Operanden: 1 + 2 + 3.",
      "numberOperandsText2": " Operanden pro Rechnung geben",
      "numberOperandsText3": "Falls der Divisions-Operator ausgewählt ist, liegt die maximale Anzahl an Operanden pro Rechnung bei ",
      "numberOperandsText4": "Falls der \"Tabellen\"-Modus ausgewählt ist, beträgt die maximale Anzahl an Operanden pro Rechnung 2",
      "tablesTitle": "Multiplikations-/Divisionstabellen",
      "tablesText1": "Diese Option erlaubt die Auswahl des \"Tabellen\"-Modus, um Multiplikations- oder Divisionstabellen zu üben. Die Tabellen-Rechnungen werden in zufälliger Reihenfolge generiert.",
      "operatorsTitle": "Operatoren",
      "operatorsText1": "Bestimmt, welche Operatoren (Addition, Substraktion, Multiplikation, Divison) in den Rechnungen verwendet werden.",
      "operatorsText2": "Die Reihenfolge der Operatoren ist zufällig. Mindestens ein Operator muss ausgewählt werden.",
      "operatorsText3": "Falls der Divisions-Operator ausgewählt ist, kann das Ergebnis von Rechnungen, die Division enthalten, nur eine ganze Zahl sein.",
      "operatorsText4": "Falls der \"Tabellen\"-Modus ausgewählt ist, sind nur die Multiplikations- und Divisionsoperatoren verfügbar.",
      "tablesRangeTitle": "Tabellenumfang",
      "tablesRangeText1": "Diese Option erlaubt die Erweiterung der Auswahlliste von Multiplikations- oder Divisionstabellen. Der gewählte Wert ist der maximale Multiplikationsfaktor oder der maximale Divisionsfaktor der Tabelle.",
      "tablesRangeText2": "Zum Beispiel, wenn der gewählte Wert für den Tabellenumfang 12 für die Tabelle von 5 ist, können die Multiplikationen maximal 5 x 12 oder die Divisionen maximal 60 ÷ 5 sein.",
      "tablesRangeText3": "Der gewählte Wert kann zwischen ",
      "tablesRangeText4": " und (inklusive) ",
      "tablesRangeText5": " liegen.",
      "tablesRangeText6": "Diese Option ist nur im \"Tabellen\"-Modus verfügbar.",
      "tablesSelectionTitle": "Tabellenauswahl",
      "tablesSelectionText1": "Erlaubt die Auswahl der Tabellen, die du üben möchtest. Die Reihenfolge der Rechnungen und Tabellen ist zufällig. Es muss mindestens eine Tabelle ausgewählt werden.",
      "tablesSelectionText2": "Diese Option ist nur im \"Tabellen\"-Modus verfügbar.",
      "numberOperationsTitle": "Anzahl an Rechnungen",
      "numberOperationsText1": "Die Anzahl an Rechnungen, die die Übung enthalten wird.",
      "numberOperationsText2": " Rechnungen pro Übung geben",
      "maximumValueTitle": "Höchstwert für Operanden",
      "maximumValueText1": "Der Höchst- (oder Mindestwert im Fall von negativen Zahlen) von einzelnen Operanden in einer Rechnung. Wenn zum Beispiel der Höchstwert für Operanden 15 ist, ist hier ein Beispiel für eine Rechnung: 5 - 2 + 15 - 13.",
      "maximumValueText2": "Der Höchstwert muss 1 oder größer sein und darf nicht größer sein als ",
      "maximumValueText3": "Falls der Divisions-Operator ausgewählt ist, kann der Höchstwert für Operanden nicht größer sein als ",
      "maximumValueText4": "Falls der \"Tabellen\"-Modus ausgewählt ist, ist dieser Parameter nicht verfügbar.",
      "negativeNumbersTitle": "Negative Zahlen",
      "negativeNumberstext1": "Bestimmt, ob die Operanden (Zahlen) oder die Rechnungsergebnisse negativ sein können.",
      "negativeNumberstext2": "Wenn diese App auf einem Smartphone oder Tablet (vor allem auf Samsung-Geräten) verwendet wird, ist es möglich, dass die Tastatur keine Taste für ein Minus enthält. Eine Option für einen Knopf, der die eingegebene Zahl in eine negative Zahl umwandelt, kann aktiviert werden."
    },
    "math": {
      "title": "Ausführen der Übung",
      "text1": "Wenn alle Parameter eingestellt sind, klicke auf ",
      "text2": " um mit der Übung zu beginnen! Mit oder ohne Timer, berechne die Ergebnisse aller Rechnungen so gut wie du kannst und klicke auf ",
      "text3": " um die Übung abzuschließen und den Timer zu stoppen, falls nötig.",
      "text4": "Sobald die Übung abgeschlossen ist, werden deine Ergebnisse angezeigt werden und alle falschen Antworten, falls es welche gibt, werden das korrigierte Ergebnis zeigen."
    },
    "pwa": {
      "title": "Installieren der App",
      "text1": "Diese App ist als \"Progressive Web App\" designt. Diese Technik erlaubt es Benutzern, die App auf einem Computer, Smartphone oder Tablet zu \"installieren\", um sie wie bei einer nativen App durch das Klicken auf ihr Icon öffnen zu können.",
      "text2": "Außerdem ist die App offline verfügbar, sobald du sie installierst oder zu ihr navigierst, sodass du dann kein \"WLAN\" und keine mobile Daten brauchst.",
      "text3": "Für weitere Informationen ist hier der Progressive Web App Wikipedia-Artikel: ",
      "text4": "Wikipedia: Progressive Web App",
      "installImage1": "Das Icon von Math Chrono",
      "installComputerTitle": "Installation auf Windows, macOS oder Linux",
      "installComputerText1": "Um die App auf einem Computer mit einem Windows, macOS oder Linux Betriebssystem zu installieren, musst du nur die Adresse eingeben und auf den Installations-Knopf in der Adresszeile deines Webbrowsers klicken.",
      "installComputerText2": "Sobald die Installation abgeschlossen ist, öffnet sich die App in einem eigenen Fenster. Zudem wird automatisch ein Icon auf dem Desktop (Windows) oder im App-Ordner (macOS) erstellt, das später zum direkten Starten der App verwendet werden kann.",
      "installComputerText3": "Progressive Web Apps werden nur in \"Chromium-basierten\" Browsern (Google Chrome, Microsoft Edge, Opera, etc.) und Safari (macOS) unterstützt.",
      "installComputerImage1": "Installations-Knopf in der Adresszeile des Browsers",
      "installMobileTitle": "Installation auf Smartphones und Tablets",
      "installMobileText1": "Um die App auf einem Smartphone oder Tablet zu installieren, musst du nur die Adresse eingeben und auf die Installations-Benachrichtigung klicken, die unten auf dem Bildschirm deines Smartphones oder Tablets erscheint.",
      "installMobileText2": "Sobald die Installation abgeschlossen ist, wird automatisch ein Icon auf deinem Startbildschirm erstellt (Android und iOS), das später zum direkten Starten der App verwendet werden kann.",
      "installMobileText3": "Progressive Web Apps werden nur in \"Chromium-basierten\" Browsern (Google Chrome, Microsoft Edge, Opera, etc.) auf Android und Safari auf iOS unterstützt.",
      "installMobileImage1": "Installations-Benachrichtigung, die unten auf dem Bilschirm angezeigt wird"
    }
  }
}