{
  "home": {
    "start": "Let's go!",
    "text1": "Get better at calculating",
    "text2": "quickly!"
  },
  "navbar": {
    "locale": "Language",
    "appearance": "Appearance",
    "help": "Help",
    "about": "About"
  },
  "aboutDialog": {
    "title": "About Math Chrono",
    "text1": "This is a little tool to help you with mental arithmetics!",
    "text2": "For any comment, question or requests, please contact me at the following address:"
  },
  "params": {
    "title": "Parameters",
    "description": "Choose from the following options in order to adjust the difficulty of the math chrono session.",
    "tablesToggleDescription": "Do you want to practice your mutliplication/division tables or your mental arithmetics?",
    "tablesLabel": "Tables",
    "mathLabel": "Arithmetics",
    "operationAmount": "How many operations do you want to execute?",
    "numberLabel": "Number",
    "yes": "Yes",
    "no": "No",
    "submit": "Start the exercise!",
    "timer": {
      "description": "Do you want to time yourself?",
      "toggle": "Timer",
      "label": "Minutes and Seconds"
    },
    "math": {
      "operandsDescription": "How many operands (numbers) do you want in your operations?",
      "operators": "Which operations do you want to execute?",
      "maximumDescription": "What do you want as the maximum value of an operand (number) in your operations?"
    },
    "negativeNumbers": {
      "description": "Do you want the operands (numbers) or the results of the operations to be negative numbers?",
      "label": "Negative Numbers",
      "mobileButtonDescription": "Some phones do not allow you to write negative numbers, if this is the case, you can activate a button in the interface in order to make a number negative.",
      "mobileButtonLabel": "Negative Number Button"
    },
    "tables": {
      "toggle": "Tables",
      "tablesMaximum": "Up to which table do you want to practice?",
      "operators": "Do you want to practice your multiplication or division tables?",
      "selectionDescription": "Which tables do you wish to practice?"
    }
  },
  "math": {
    "title": "Math Chrono!",
    "start": "Start!",
    "text1": "Click on ",
    "text2": " when you're ready!",
    "done": "Done!",
    "back": "Back",
    "restart": "Restart?"
  },
  "completed": {
    "title": "It's over!",
    "result": "Here is your result:",
    "resultText1": "You solved",
    "resultText2singular": "operation",
    "resultText2plural": "operations",
    "resultText3": "out of",
    "resultText4": "in",
    "hour": "hour",
    "hours": "hours",
    "minute": "minute",
    "minutes": "minutes",
    "second": "second",
    "seconds": "seconds",
    "done1": "Nice try!",
    "done2": "You're getting better!",
    "done3": "Very good!",
    "done4": "Fantastic!",
    "done5": "Wow, perfect score!"
  },
  "update": {
    "message": "A new version of Math-Chrono is available!",
    "reload": "Reload"
  },
  "howTo": {
    "title": "How does this work?",
    "tableOfContent": "Table of contents",
    "general": {
      "title": "What is this application for?",
      "text1": "This application is a tool that helps practice mental arithmetics, with or without a timer. Many options are configurable in order to customize the difficulty level of each exercise to the user's level. This way, the challenge increases incrementally and creates a feeling of constant progression.",
      "text2": "Once the parameters are entered and the exercice is launched, the operations are randomly generated by the application. When the countdown stops, input the operation results as fast as possible!"
    },
    "params": {
      "title": "Parameters descriptions",
      "genericMinimum": "There can be a minimum of ",
      "genericMaximum": " and a maximum of ",
      "timerTitle": "Timer",
      "timerText": "Activates or deactivates the timer. If active, a time limit can be inputed in hours, minutes and seconds. For example, 00:05:30 for 5 minutes and 30 seconds.",
      "numberOperandsTitle": "Number of operands",
      "numberOperandsText1": "How many operands (numbers) are there in each operation. For example, here is an operation with 3 operands: 1 + 2 + 3.",
      "numberOperandsText2": " operands per operation",
      "numberOperandsText3": "If the division operator is selected, the maximum amount of operands per operation is ",
      "numberOperandsText4": "If the \"tables\" mode is selected, the maximum amount of operands per operation is 2",
      "tablesTitle": "Multiplicaiton/Division tables",
      "tablesText1": "This options allows the selection of the \"tables\" mode in order to practice multiplication and or division tables. The tables operations will be generated in a random order.",
      "operatorsTitle": "Operators",
      "operatorsText1": "Which operators (addition, substraction, multiplication, division) will be used in the operations.",
      "operatorsText2": "The operators' order is randomized. At least one operator must be selected.",
      "operatorsText3": "If the division operator is selected, the result of the operations containing divisions can only be whole numbers.",
      "operatorsText4": "If the \"tables\" mode is selected, only the multiplication and division operators are available.",
      "tablesRangeTitle": "Tables range",
      "tablesRangeText1": "This option allows the extention of multiplication or division tables selection choice list. The selected value becomes the maximum multiplication factor of the table or the maximum division factor of the table.",
      "tablesRangeText2": "For example, if the selected tables range number is 12 for the tables of 5, the multiplications can go up to 5 x 12 or the divisions up to 60 รท 5.",
      "tablesRangeText3": "The selection value can be between ",
      "tablesRangeText4": " and ",
      "tablesRangeText5": " inclusively.",
      "tablesRangeText6": "This option is only available in \"tables\" mode.",
      "tablesSelectionTitle": "Tables selection",
      "tablesSelectionText1": "Allows the selection of which tables to practice. The order of the operations and tables is random. At least one table must be selected.",
      "tablesSelectionText2": "This option is only available in \"tables\" mode.",
      "numberOperationsTitle": "Operations amount",
      "numberOperationsText1": "How many operations will the exercise contain.",
      "numberOperationsText2": " operations per exercise",
      "maximumValueTitle": "Maximum value for operands",
      "maximumValueText1": "The maximum (or minimum in the case of negative numbers) value of individual operands in an operation. For example, if the maximum operand value is 15, here is an example of an operation: 5 - 2 + 15 - 13.",
      "maximumValueText2": "The maximum value must be between 1 and ",
      "maximumValueText3": "If the division operator is selected, the operand maximum value cannot be superior to ",
      "maximumValueText4": "If the \"tables\" mode is selected, this parameter is not available.",
      "negativeNumbersTitle": "Negative numbers",
      "negativeNumberstext1": "Can the operands (numbers) or the operation results be negative.",
      "negativeNumberstext2": "When using this application on a mobile device (Samsung devices in particular), it is possible that the keyboard doesn't include a negative key. An option to display a button that tranforms the inputed number into a negative number can be turned on."
    },
    "math": {
      "title": "Performing the exercice",
      "text1": "When all parameters are selected, click on ",
      "text2": " to begin the exercice! With or without a timer, answer all of the equations as best as you can and click on ",
      "text3": " in order to complete the exercise and stop the timer if need be.",
      "text4": "Once the exercise is done, your results will be displayed and all wrong answers, if any, will show the corrected result."
    },
    "pwa": {
      "title": "Installing the application",
      "text1": "This application is desgined as a \"Progressive Web Application\" (PWA). This technology allows users to \"install\" the application on a computer or a mobile device, in order to access it by clicking on its icon, just like a native application.",
      "text2": "Furthermore, once you install or navigate once to the application, it becomes available offline, without the need for \"Wifi\" or mobile data.",
      "text3": "For more information, here is the Progressive Web Application Wikipedia article: ",
      "text4": "Wikipedia: Progressive Web Application",
      "installImage1": "The Math Chrono icon",
      "installComputerTitle": "Installation on Windows, macOS or Linux",
      "installComputerText1": "In order to install the application on a computer with a Windows, macOS or Linux operating system, you just have to access the address and click on the installation button of the web browser's address bar.",
      "installComputerText2": "Once the installation is complete, the application will open in a standalone window. Furthermore, an icon will automatically be added on the desktop (Windows) or in the applications directory (macOS) that can later be used to start the application directly.",
      "installComputerText3": "Progressive Web Applications are only supported on \"Chromium-based\" browsers (Google Chrome, Microsoft Edge, Opera, etc.) and Safari (macOS).",
      "installComputerImage1": "Installation button in the browser address bar",
      "installMobileTitle": "Installation on mobile devices",
      "installMobileText1": "In order to install the application on a mobile device, you just have to access the address and click on the installation notification that appears on the bottom of your mobile device's screen.",
      "installMobileText2": "Once the installation is complete, an icon will automatically be added on the home screen (Android and iOS) that can later be used to directly start the application.",
      "installMobileText3": "Progressive Web Applications are only supported on \"Chromium-based\" browsers (Google Chrome, Microsoft Edge, Opera, etc.) on Android and Safari on iOS.",
      "installMobileImage1": "Installation notification displayed in the bottom of the screen"
    }
  }
}
